{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 96, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "batch_input_shape": [null, 96, 64], "dtype": "float32", "target_shape": [96, 64, 1]}, "name": "reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer1/conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer1/conv", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer1/conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer1/conv/bn", "inbound_nodes": [[["layer1/conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer1/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer1/relu", "inbound_nodes": [[["layer1/conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer2/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer2/depthwise_conv", "inbound_nodes": [[["layer1/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer2/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer2/depthwise_conv/bn", "inbound_nodes": [[["layer2/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer2/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer2/depthwise_conv/relu", "inbound_nodes": [[["layer2/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer2/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer2/pointwise_conv", "inbound_nodes": [[["layer2/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer2/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer2/pointwise_conv/bn", "inbound_nodes": [[["layer2/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer2/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer2/pointwise_conv/relu", "inbound_nodes": [[["layer2/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer3/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer3/depthwise_conv", "inbound_nodes": [[["layer2/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer3/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer3/depthwise_conv/bn", "inbound_nodes": [[["layer3/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer3/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer3/depthwise_conv/relu", "inbound_nodes": [[["layer3/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer3/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer3/pointwise_conv", "inbound_nodes": [[["layer3/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer3/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer3/pointwise_conv/bn", "inbound_nodes": [[["layer3/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer3/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer3/pointwise_conv/relu", "inbound_nodes": [[["layer3/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer4/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer4/depthwise_conv", "inbound_nodes": [[["layer3/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer4/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer4/depthwise_conv/bn", "inbound_nodes": [[["layer4/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer4/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer4/depthwise_conv/relu", "inbound_nodes": [[["layer4/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer4/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer4/pointwise_conv", "inbound_nodes": [[["layer4/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer4/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer4/pointwise_conv/bn", "inbound_nodes": [[["layer4/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer4/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer4/pointwise_conv/relu", "inbound_nodes": [[["layer4/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer5/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer5/depthwise_conv", "inbound_nodes": [[["layer4/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer5/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer5/depthwise_conv/bn", "inbound_nodes": [[["layer5/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer5/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer5/depthwise_conv/relu", "inbound_nodes": [[["layer5/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer5/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer5/pointwise_conv", "inbound_nodes": [[["layer5/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer5/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer5/pointwise_conv/bn", "inbound_nodes": [[["layer5/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer5/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer5/pointwise_conv/relu", "inbound_nodes": [[["layer5/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer6/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer6/depthwise_conv", "inbound_nodes": [[["layer5/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer6/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer6/depthwise_conv/bn", "inbound_nodes": [[["layer6/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer6/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer6/depthwise_conv/relu", "inbound_nodes": [[["layer6/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer6/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer6/pointwise_conv", "inbound_nodes": [[["layer6/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer6/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer6/pointwise_conv/bn", "inbound_nodes": [[["layer6/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer6/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer6/pointwise_conv/relu", "inbound_nodes": [[["layer6/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer7/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer7/depthwise_conv", "inbound_nodes": [[["layer6/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer7/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer7/depthwise_conv/bn", "inbound_nodes": [[["layer7/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer7/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer7/depthwise_conv/relu", "inbound_nodes": [[["layer7/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer7/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer7/pointwise_conv", "inbound_nodes": [[["layer7/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer7/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer7/pointwise_conv/bn", "inbound_nodes": [[["layer7/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer7/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer7/pointwise_conv/relu", "inbound_nodes": [[["layer7/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer8/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer8/depthwise_conv", "inbound_nodes": [[["layer7/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer8/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer8/depthwise_conv/bn", "inbound_nodes": [[["layer8/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer8/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer8/depthwise_conv/relu", "inbound_nodes": [[["layer8/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer8/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer8/pointwise_conv", "inbound_nodes": [[["layer8/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer8/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer8/pointwise_conv/bn", "inbound_nodes": [[["layer8/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer8/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer8/pointwise_conv/relu", "inbound_nodes": [[["layer8/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer9/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer9/depthwise_conv", "inbound_nodes": [[["layer8/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer9/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer9/depthwise_conv/bn", "inbound_nodes": [[["layer9/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer9/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer9/depthwise_conv/relu", "inbound_nodes": [[["layer9/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer9/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer9/pointwise_conv", "inbound_nodes": [[["layer9/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer9/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer9/pointwise_conv/bn", "inbound_nodes": [[["layer9/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer9/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer9/pointwise_conv/relu", "inbound_nodes": [[["layer9/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer10/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer10/depthwise_conv", "inbound_nodes": [[["layer9/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer10/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer10/depthwise_conv/bn", "inbound_nodes": [[["layer10/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer10/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer10/depthwise_conv/relu", "inbound_nodes": [[["layer10/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer10/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer10/pointwise_conv", "inbound_nodes": [[["layer10/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer10/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer10/pointwise_conv/bn", "inbound_nodes": [[["layer10/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer10/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer10/pointwise_conv/relu", "inbound_nodes": [[["layer10/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer11/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer11/depthwise_conv", "inbound_nodes": [[["layer10/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer11/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer11/depthwise_conv/bn", "inbound_nodes": [[["layer11/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer11/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer11/depthwise_conv/relu", "inbound_nodes": [[["layer11/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer11/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer11/pointwise_conv", "inbound_nodes": [[["layer11/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer11/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer11/pointwise_conv/bn", "inbound_nodes": [[["layer11/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer11/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer11/pointwise_conv/relu", "inbound_nodes": [[["layer11/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer12/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer12/depthwise_conv", "inbound_nodes": [[["layer11/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer12/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer12/depthwise_conv/bn", "inbound_nodes": [[["layer12/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer12/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer12/depthwise_conv/relu", "inbound_nodes": [[["layer12/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer12/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer12/pointwise_conv", "inbound_nodes": [[["layer12/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer12/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer12/pointwise_conv/bn", "inbound_nodes": [[["layer12/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer12/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer12/pointwise_conv/relu", "inbound_nodes": [[["layer12/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer13/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer13/depthwise_conv", "inbound_nodes": [[["layer12/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer13/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer13/depthwise_conv/bn", "inbound_nodes": [[["layer13/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer13/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer13/depthwise_conv/relu", "inbound_nodes": [[["layer13/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer13/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer13/pointwise_conv", "inbound_nodes": [[["layer13/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer13/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer13/pointwise_conv/bn", "inbound_nodes": [[["layer13/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer13/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer13/pointwise_conv/relu", "inbound_nodes": [[["layer13/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "layer14/depthwise_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "layer14/depthwise_conv", "inbound_nodes": [[["layer13/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer14/depthwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer14/depthwise_conv/bn", "inbound_nodes": [[["layer14/depthwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer14/depthwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer14/depthwise_conv/relu", "inbound_nodes": [[["layer14/depthwise_conv/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "layer14/pointwise_conv", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "layer14/pointwise_conv", "inbound_nodes": [[["layer14/depthwise_conv/relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "layer14/pointwise_conv/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.0001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer14/pointwise_conv/bn", "inbound_nodes": [[["layer14/pointwise_conv", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "layer14/pointwise_conv/relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "layer14/pointwise_conv/relu", "inbound_nodes": [[["layer14/pointwise_conv/bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d", "inbound_nodes": [[["layer14/pointwise_conv/relu", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}